In [1]:
import numpy as np
import pandas as pd
pd.options.display.max_columns = 69
pd.options.display.max_rows = 69

import matplotlib.pyplot as plt
import seaborn as sns
import mason_functions as mf
import explore
import wrangle
import scale

In [2]:
#load data
df = pd.read_csv('employee_attrition.xls', index_col = 0)

#preview data
df.head()

,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
Age,,,,,,,,,,,,,,,,,,,,,
41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,2,...,1,80,0,8,0,1,6,4,0,5
49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,3,...,4,80,1,10,3,3,10,7,1,7
37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,4,...,2,80,0,7,3,3,0,0,0,0
33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,4,...,3,80,0,8,3,3,8,7,3,0
27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,1,...,4,80,1,6,3,3,2,2,2,2

In [3]:
#get dataframe info
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1470 entries, 41 to 34
Data columns (total 34 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Attrition                 1470 non-null   object
 1   BusinessTravel            1470 non-null   object
 2   DailyRate                 1470 non-null   int64
 3   Department                1470 non-null   object
 4   DistanceFromHome          1470 non-null   int64
 5   Education                 1470 non-null   int64
 6   EducationField            1470 non-null   object
 7   EmployeeCount             1470 non-null   int64
 8   EmployeeNumber            1470 non-null   int64
 9   EnvironmentSatisfaction   1470 non-null   int64
 10  Gender                    1470 non-null   object
 11  HourlyRate                1470 non-null   int64
 12  JobInvolvement            1470 non-null   int64
 13  JobLevel                  1470 non-null   int64
 14  JobRole                   1470 non-null   object
 15  JobSatisfaction           1470 non-null   int64
 16  MaritalStatus             1470 non-null   object
 17  MonthlyIncome             1470 non-null   int64
 18  MonthlyRate               1470 non-null   int64
 19  NumCompaniesWorked        1470 non-null   int64
 20  Over18                    1470 non-null   object
 21  OverTime                  1470 non-null   object
 22  PercentSalaryHike         1470 non-null   int64
 23  PerformanceRating         1470 non-null   int64
 24  RelationshipSatisfaction  1470 non-null   int64
 25  StandardHours             1470 non-null   int64
 26  StockOptionLevel          1470 non-null   int64
 27  TotalWorkingYears         1470 non-null   int64
 28  TrainingTimesLastYear     1470 non-null   int64
 29  WorkLifeBalance           1470 non-null   int64
 30  YearsAtCompany            1470 non-null   int64
 31  YearsInCurrentRole        1470 non-null   int64
 32  YearsSinceLastPromotion   1470 non-null   int64
 33  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(25), object(9)
memory usage: 402.0+ KB

Education
* 1 'Below College'
* 2 'College'
* 3 'Bachelor'
* 4 'Master'
* 5 'Doctor'
 
EnvironmentSatisfaction
* 1 'Low'
* 2 'Medium'
* 3 'High'
* 4 'Very High'
 
JobInvolvement 
* 1 'Low'
* 2 'Medium'
* 3 'High'
* 4 'Very High'
 
JobSatisfaction 
* 1 'Low'
* 2 'Medium'
* 3 'High'
* 4 'Very High'
 
PerformanceRating 
* 1 'Low'
* 2 'Good'
* 3 'Excellent'
* 4 'Outstanding'
 
RelationshipSatisfaction 
* 1 'Low'
* 2 'Medium'
* 3 'High'
* 4 'Very High'
 
WorkLifeBalance 
* 1 'Bad'
* 2 'Good'
* 3 'Better'
* 4 'Best'

In [4]:
#get rid of camel-case (lower case all of the columns) 
df.columns = df.columns.str.lower()

In [5]:
#rename columns
df = df.rename(columns = {'businesstravel': 'business_travel',
                          'dailyrate': 'daily_rate',
                          'distancefromhome': 'distance_from_home',
                          'educationfield': 'education_field',
                          'employeecount': 'employee_count',
                          'employeenumber': 'employee_id',
                          'environmentsatisfaction': 'environment_satisfaction',
                          'hourlyrate': 'hourly_rate',
                          'jobinvolvement': 'job_involvement',
                          'joblevel': 'job_level',
                          'jobrole': 'job_role',
                          'jobsatisfaction': 'job_satisfaction',
                          'maritalstatus': 'marital_status',
                          'monthlyincome': 'monthly_income',
                          'monthlyrate': 'monthly_rate',
                          'numcompaniesworked': 'companies_worked',
                          'percentsalaryhike': 'percent_salary_hike',
                          'performancerating': 'performance_rating',
                          'relationshipsatisfaction': 'relationship_satisfaction',
                          'standardhours': 'standard_hours',
                          'stockoptionlevel': 'stock_option_level',
                          'totalworkingyears': 'total_working_years',
                          'trainingtimeslastyear': 'hours_trained_last_year',
                          'worklifebalance': 'work_life_balance',
                          'yearsatcompany': 'company_years',
                          'yearsincurrentrole': 'current_role_years',
                          'yearssincelastpromotion': 'years_since_last_promotion',
                          'yearswithcurrmanager': 'years_with_manager'
                         }
              )

In [6]:
#gather all the columns with numeric data types in a list
#numeric = df.columns[df.dtypes == 'int64'].to_list()

I want to explore differences in model performance from discrete features. I will make a list of out of the discrete variables. For items in this list, the item can be measured on a scale from 1 to 4 (except the education, that is on a scale of 1 to 5), or the item can be viewed as a category.

In [7]:
#check df info
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1470 entries, 41 to 34
Data columns (total 34 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   attrition                   1470 non-null   object
 1   business_travel             1470 non-null   object
 2   daily_rate                  1470 non-null   int64
 3   department                  1470 non-null   object
 4   distance_from_home          1470 non-null   int64
 5   education                   1470 non-null   int64
 6   education_field             1470 non-null   object
 7   employee_count              1470 non-null   int64
 8   employee_id                 1470 non-null   int64
 9   environment_satisfaction    1470 non-null   int64
 10  gender                      1470 non-null   object
 11  hourly_rate                 1470 non-null   int64
 12  job_involvement             1470 non-null   int64
 13  job_level                   1470 non-null   int64
 14  job_role                    1470 non-null   object
 15  job_satisfaction            1470 non-null   int64
 16  marital_status              1470 non-null   object
 17  monthly_income              1470 non-null   int64
 18  monthly_rate                1470 non-null   int64
 19  companies_worked            1470 non-null   int64
 20  over18                      1470 non-null   object
 21  overtime                    1470 non-null   object
 22  percent_salary_hike         1470 non-null   int64
 23  performance_rating          1470 non-null   int64
 24  relationship_satisfaction   1470 non-null   int64
 25  standard_hours              1470 non-null   int64
 26  stock_option_level          1470 non-null   int64
 27  total_working_years         1470 non-null   int64
 28  hours_trained_last_year     1470 non-null   int64
 29  work_life_balance           1470 non-null   int64
 30  company_years               1470 non-null   int64
 31  current_role_years          1470 non-null   int64
 32  years_since_last_promotion  1470 non-null   int64
 33  years_with_manager          1470 non-null   int64
dtypes: int64(25), object(9)
memory usage: 402.0+ KB

I want to get a feel for the data I am about to explore, and I would like to separate the data into numeric, categorical and discrete features. I will now loop through all of the columns to get a better feel as to what's available and what goes where.

In [8]:
#loop through columns to print number of unique values that each feature has
for col in df.columns:
    print(f'{col}: {df[col].nunique()}')
    print('---')

attrition: 2
---
business_travel: 3
---
daily_rate: 886
---
department: 3
---
distance_from_home: 29
---
education: 5
---
education_field: 6
---
employee_count: 1
---
employee_id: 1470
---
environment_satisfaction: 4
---
gender: 2
---
hourly_rate: 71
---
job_involvement: 4
---
job_level: 5
---
job_role: 9
---
job_satisfaction: 4
---
marital_status: 3
---
monthly_income: 1349
---
monthly_rate: 1427
---
companies_worked: 10
---
over18: 1
---
overtime: 2
---
percent_salary_hike: 15
---
performance_rating: 2
---
relationship_satisfaction: 4
---
standard_hours: 1
---
stock_option_level: 4
---
total_working_years: 40
---
hours_trained_last_year: 7
---
work_life_balance: 4
---
company_years: 37
---
current_role_years: 19
---
years_since_last_promotion: 16
---
years_with_manager: 18
---

Which features will I leave behind? Which ones will I dummy?

In [9]:
#loop through columns, and print out values and counts for each feature
for col in df.columns:
    print(col)
    print('---')
    print(df[col].value_counts())
    print('==============')
    print('              ')

attrition
---
No     1233
Yes     237
Name: attrition, dtype: int64
==============

business_travel
---
Travel_Rarely        1043
Travel_Frequently     277
Non-Travel            150
Name: business_travel, dtype: int64
==============

daily_rate
---
691     6
1082    5
408     5
329     5
530     5
       ..
708     1
713     1
717     1
719     1
1499    1
Name: daily_rate, Length: 886, dtype: int64
==============

department
---
Research & Development    961
Sales                     446
Human Resources            63
Name: department, dtype: int64
==============

distance_from_home
---
2     211
1     208
10     86
9      85
3      84
7      84
8      80
5      65
4      64
6      59
16     32
11     29
24     28
23     27
29     27
18     26
15     26
20     25
25     25
26     25
28     23
19     22
14     21
17     20
12     20
22     19
13     19
21     18
27     12
Name: distance_from_home, dtype: int64
==============

education
---
3    572
4    398
2    282
1    170
5     48
Name: education, dtype: int64
==============

education_field
---
Life Sciences       606
Medical             464
Marketing           159
Technical Degree    132
Other                82
Human Resources      27
Name: education_field, dtype: int64
==============

employee_count
---
1    1470
Name: employee_count, dtype: int64
==============

employee_id
---
2048    1
1368    1
1364    1
1363    1
1362    1
       ..
648     1
647     1
645     1
644     1
2046    1
Name: employee_id, Length: 1470, dtype: int64
==============

environment_satisfaction
---
3    453
4    446
2    287
1    284
Name: environment_satisfaction, dtype: int64
==============

gender
---
Male      882
Female    588
Name: gender, dtype: int64
==============

hourly_rate
---
66    29
42    28
98    28
84    28
48    28
      ..
69    15
53    14
68    14
38    13
34    12
Name: hourly_rate, Length: 71, dtype: int64
==============

job_involvement
---
3    868
2    375
4    144
1     83
Name: job_involvement, dtype: int64
==============

job_level
---
1    543
2    534
3    218
4    106
5     69
Name: job_level, dtype: int64
==============

job_role
---
Sales Executive              326
Research Scientist           292
Laboratory Technician        259
Manufacturing Director       145
Healthcare Representative    131
Manager                      102
Sales Representative          83
Research Director             80
Human Resources               52
Name: job_role, dtype: int64
==============

job_satisfaction
---
4    459
3    442
1    289
2    280
Name: job_satisfaction, dtype: int64
==============

marital_status
---
Married     673
Single      470
Divorced    327
Name: marital_status, dtype: int64
==============

monthly_income
---
2342     4
6142     3
2610     3
2559     3
6347     3
        ..
4103     1
2705     1
6796     1
19717    1
10239    1
Name: monthly_income, Length: 1349, dtype: int64
==============

monthly_rate
---
4223     3
9150     3
9096     2
13008    2
12858    2
        ..
17071    1
23213    1
3835     1
25258    1
12287    1
Name: monthly_rate, Length: 1427, dtype: int64
==============

companies_worked
---
1    521
0    197
3    159
2    146
4    139
7     74
6     70
5     63
9     52
8     49
Name: companies_worked, dtype: int64
==============

over18
---
Y    1470
Name: over18, dtype: int64
==============

overtime
---
No     1054
Yes     416
Name: overtime, dtype: int64
==============

percent_salary_hike
---
11    210
13    209
14    201
12    198
15    101
18     89
17     82
16     78
19     76
22     56
20     55
21     48
23     28
24     21
25     18
Name: percent_salary_hike, dtype: int64
==============

performance_rating
---
3    1244
4     226
Name: performance_rating, dtype: int64
==============

relationship_satisfaction
---
3    459
4    432
2    303
1    276
Name: relationship_satisfaction, dtype: int64
==============

standard_hours
---
80    1470
Name: standard_hours, dtype: int64
==============

stock_option_level
---
0    631
1    596
2    158
3     85
Name: stock_option_level, dtype: int64
==============

total_working_years
---
10    202
6     125
8     103
9      96
5      88
7      81
1      81
4      63
12     48
3      42
15     40
16     37
13     36
11     36
21     34
17     33
14     31
2      31
20     30
18     27
19     22
23     22
22     21
24     18
28     14
25     14
26     14
0      11
29     10
31      9
32      9
27      7
30      7
33      7
36      6
34      5
37      4
35      3
40      2
38      1
Name: total_working_years, dtype: int64
==============

hours_trained_last_year
---
2    547
3    491
4    123
5    119
1     71
6     65
0     54
Name: hours_trained_last_year, dtype: int64
==============

work_life_balance
---
3    893
2    344
4    153
1     80
Name: work_life_balance, dtype: int64
==============

company_years
---
5     196
1     171
3     128
2     127
10    120
4     110
7      90
9      82
8      80
6      76
0      44
11     32
20     27
13     24
15     20
14     18
22     15
12     14
21     14
18     13
16     12
19     11
17      9
24      6
33      5
25      4
26      4
31      3
32      3
36      2
29      2
27      2
23      2
30      1
34      1
37      1
40      1
Name: company_years, dtype: int64
==============

current_role_years
---
2     372
0     244
7     222
3     135
4     104
8      89
9      67
1      57
6      37
5      36
10     29
11     22
13     14
14     11
12     10
15      8
16      7
17      4
18      2
Name: current_role_years, dtype: int64
==============

years_since_last_promotion
---
0     581
1     357
2     159
7      76
4      61
3      52
5      45
6      32
11     24
8      18
9      17
15     13
12     10
13     10
14      9
10      6
Name: years_since_last_promotion, dtype: int64
==============

years_with_manager
---
2     344
0     263
7     216
3     142
8     107
4      98
1      76
9      64
5      31
6      29
10     27
11     22
12     18
13     14
17      7
14      5
15      5
16      2
Name: years_with_manager, dtype: int64
==============

In [10]:
#set a list of categorical columns based on the columns above
categorical = ['attrition',
               'business_travel',
               'department',
               'education_field',
               'gender',
               'job_role',
               'marital_status',
               'overtime'
              ]

#set a list of discrete columns
discrete = ['education',
            'environment_satisfaction',
            'job_involvement',
            'job_level',
            'job_satisfaction',
            'performance_rating',
            'relationship_satisfaction', 
            'stock_option_level',
            'work_life_balance'
           ]

#set a list of numeric columns
numeric = ['daily_rate',
           'distance_from_home',
           'education',
           'environment_satisfaction',
           'hourly_rate',
           'job_involvement',
           'job_level',
           'job_role',
           'job_satisfaction',
           'monthly_income',
           'monthly_rate',
           'companies_worked',
           'percent_salary_hike',
           'performance_rating',
           'relationship_satisfaction',
           'stock_option_level',
           'total_working_years',
           'hours_trained_last_year',
           'work_life_balance',
           'company_years',
           'current_role_years',
           'years_since_last_promotion',
           'years_with_manager'
          ]

#set a list of columns to drop
superfluous = ['employee_count', 'over18', 'standard_hours']

#drop these columns
df = df.drop(columns = superfluous)

In [11]:
for cat in categorical:
    print(cat)
    print('---')
    print(df[cat].value_counts())
    print('==============')
    print('              ')

attrition
---
No     1233
Yes     237
Name: attrition, dtype: int64
==============

business_travel
---
Travel_Rarely        1043
Travel_Frequently     277
Non-Travel            150
Name: business_travel, dtype: int64
==============

department
---
Research & Development    961
Sales                     446
Human Resources            63
Name: department, dtype: int64
==============

education_field
---
Life Sciences       606
Medical             464
Marketing           159
Technical Degree    132
Other                82
Human Resources      27
Name: education_field, dtype: int64
==============

gender
---
Male      882
Female    588
Name: gender, dtype: int64
==============

job_role
---
Sales Executive              326
Research Scientist           292
Laboratory Technician        259
Manufacturing Director       145
Healthcare Representative    131
Manager                      102
Sales Representative          83
Research Director             80
Human Resources               52
Name: job_role, dtype: int64
==============

marital_status
---
Married     673
Single      470
Divorced    327
Name: marital_status, dtype: int64
==============

overtime
---
No     1054
Yes     416
Name: overtime, dtype: int64
==============

In [12]:
#map simple categorical columns to 1 and 0
df.attrition = df.attrition.map({'No': 0, 'Yes': 1})
df.overtime = df.overtime.map({'No': 0, 'Yes': 1})

#remove attrition and overtime since we just one-hot encoded them already
categorical.remove('attrition')
categorical.remove('overtime')

In [13]:
#assign dataframe to dummied variables
dummies = pd.get_dummies(df[categorical], drop_first = False)

#preview
dummies.head()

,business_travel_Non-Travel,business_travel_Travel_Frequently,business_travel_Travel_Rarely,department_Human Resources,department_Research & Development,department_Sales,education_field_Human Resources,education_field_Life Sciences,education_field_Marketing,education_field_Medical,...,job_role_Laboratory Technician,job_role_Manager,job_role_Manufacturing Director,job_role_Research Director,job_role_Research Scientist,job_role_Sales Executive,job_role_Sales Representative,marital_status_Divorced,marital_status_Married,marital_status_Single
Age,,,,,,,,,,,,,,,,,,,,,
41,0,0,1,0,0,1,0,1,0,0,...,0,0,0,0,0,1,0,0,0,1
49,0,1,0,0,1,0,0,1,0,0,...,0,0,0,0,1,0,0,0,1,0
37,0,0,1,0,1,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,1
33,0,1,0,0,1,0,0,1,0,0,...,0,0,0,0,1,0,0,0,1,0
27,0,0,1,0,1,0,0,0,0,1,...,1,0,0,0,0,0,0,0,1,0

In [14]:
#look at columns
dummies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1470 entries, 41 to 34
Data columns (total 26 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   business_travel_Non-Travel          1470 non-null   uint8
 1   business_travel_Travel_Frequently   1470 non-null   uint8
 2   business_travel_Travel_Rarely       1470 non-null   uint8
 3   department_Human Resources          1470 non-null   uint8
 4   department_Research & Development   1470 non-null   uint8
 5   department_Sales                    1470 non-null   uint8
 6   education_field_Human Resources     1470 non-null   uint8
 7   education_field_Life Sciences       1470 non-null   uint8
 8   education_field_Marketing           1470 non-null   uint8
 9   education_field_Medical             1470 non-null   uint8
 10  education_field_Other               1470 non-null   uint8
 11  education_field_Technical Degree    1470 non-null   uint8
 12  gender_Female                       1470 non-null   uint8
 13  gender_Male                         1470 non-null   uint8
 14  job_role_Healthcare Representative  1470 non-null   uint8
 15  job_role_Human Resources            1470 non-null   uint8
 16  job_role_Laboratory Technician      1470 non-null   uint8
 17  job_role_Manager                    1470 non-null   uint8
 18  job_role_Manufacturing Director     1470 non-null   uint8
 19  job_role_Research Director          1470 non-null   uint8
 20  job_role_Research Scientist         1470 non-null   uint8
 21  job_role_Sales Executive            1470 non-null   uint8
 22  job_role_Sales Representative       1470 non-null   uint8
 23  marital_status_Divorced             1470 non-null   uint8
 24  marital_status_Married              1470 non-null   uint8
 25  marital_status_Single               1470 non-null   uint8
dtypes: uint8(26)
memory usage: 48.8 KB

In [15]:
#lowercase all dummies. replace superfluous string with nothing. clean up columns
dummies.columns = dummies.columns.str.lower().\
str.replace(' ', '_').\
str.replace('business_travel_', '').\
str.replace('department_human_resources', 'hr_dept').\
str.replace('department_', '').\
str.replace('education_field_human_resources', 'hr_ed').\
str.replace('education_field_', '').\
str.replace('gender_', '').\
str.replace('job_role_human_resources', 'hr_job').\
str.replace('job_role_', '').\
str.replace('marital_status_', '').\
str.replace('&', '').\
str.replace('__', '_').\
str.replace('non-travel', 'travel_none').\
str.replace('development', 'dev_dept').\
str.replace('sales', 'sales_dept').\
str.replace('human_resources', 'hr_ed', 1).\
str.replace('life_sciences', 'life_sciences_ed').\
str.replace('marketing', 'marketing_ed').\
str.replace('medical', 'medical_ed').\
str.replace('other', 'other_ed').\
str.replace('technical_degree', 'tech_deg_ed').\
str.replace('gender_', '').\
str.replace('healthcare_representative', 'healthcare_rep_job').\
str.replace('laboratory_technician', 'lab_tech_job').\
str.replace('manager', 'manager_job').\
str.replace('manufacturing_director', 'manufacturing_dir_job').\
str.replace('research_director', 'research_dir_job').\
str.replace('research_scientist', 'research_scientist_job').\
str.replace('sales_dept_executive', 'sales_exec_job').\
str.replace('sales_dept_representative', 'sales_rep_job')

In [16]:
dummies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1470 entries, 41 to 34
Data columns (total 26 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   travel_none             1470 non-null   uint8
 1   travel_frequently       1470 non-null   uint8
 2   travel_rarely           1470 non-null   uint8
 3   hr_dept                 1470 non-null   uint8
 4   research_dev_dept       1470 non-null   uint8
 5   sales_dept              1470 non-null   uint8
 6   hr_ed                   1470 non-null   uint8
 7   life_sciences_ed        1470 non-null   uint8
 8   marketing_ed            1470 non-null   uint8
 9   medical_ed              1470 non-null   uint8
 10  other_ed                1470 non-null   uint8
 11  tech_deg_ed             1470 non-null   uint8
 12  female                  1470 non-null   uint8
 13  male                    1470 non-null   uint8
 14  healthcare_rep_job      1470 non-null   uint8
 15  hr_job                  1470 non-null   uint8
 16  lab_tech_job            1470 non-null   uint8
 17  manager_job             1470 non-null   uint8
 18  manufacturing_dir_job   1470 non-null   uint8
 19  research_dir_job        1470 non-null   uint8
 20  research_scientist_job  1470 non-null   uint8
 21  sales_exec_job          1470 non-null   uint8
 22  sales_rep_job           1470 non-null   uint8
 23  divorced                1470 non-null   uint8
 24  married                 1470 non-null   uint8
 25  single                  1470 non-null   uint8
dtypes: uint8(26)
memory usage: 48.8 KB

In [17]:
dummies = dummies.drop(columns = 'male')

In [18]:
dummies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1470 entries, 41 to 34
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   travel_none             1470 non-null   uint8
 1   travel_frequently       1470 non-null   uint8
 2   travel_rarely           1470 non-null   uint8
 3   hr_dept                 1470 non-null   uint8
 4   research_dev_dept       1470 non-null   uint8
 5   sales_dept              1470 non-null   uint8
 6   hr_ed                   1470 non-null   uint8
 7   life_sciences_ed        1470 non-null   uint8
 8   marketing_ed            1470 non-null   uint8
 9   medical_ed              1470 non-null   uint8
 10  other_ed                1470 non-null   uint8
 11  tech_deg_ed             1470 non-null   uint8
 12  female                  1470 non-null   uint8
 13  healthcare_rep_job      1470 non-null   uint8
 14  hr_job                  1470 non-null   uint8
 15  lab_tech_job            1470 non-null   uint8
 16  manager_job             1470 non-null   uint8
 17  manufacturing_dir_job   1470 non-null   uint8
 18  research_dir_job        1470 non-null   uint8
 19  research_scientist_job  1470 non-null   uint8
 20  sales_exec_job          1470 non-null   uint8
 21  sales_rep_job           1470 non-null   uint8
 22  divorced                1470 non-null   uint8
 23  married                 1470 non-null   uint8
 24  single                  1470 non-null   uint8
dtypes: uint8(25)
memory usage: 47.4 KB

In [19]:
dummies.head()

,travel_none,travel_frequently,travel_rarely,hr_dept,research_dev_dept,sales_dept,hr_ed,life_sciences_ed,marketing_ed,medical_ed,...,lab_tech_job,manager_job,manufacturing_dir_job,research_dir_job,research_scientist_job,sales_exec_job,sales_rep_job,divorced,married,single
Age,,,,,,,,,,,,,,,,,,,,,
41,0,0,1,0,0,1,0,1,0,0,...,0,0,0,0,0,1,0,0,0,1
49,0,1,0,0,1,0,0,1,0,0,...,0,0,0,0,1,0,0,0,1,0
37,0,0,1,0,1,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,1
33,0,1,0,0,1,0,0,1,0,0,...,0,0,0,0,1,0,0,0,1,0
27,0,0,1,0,1,0,0,0,0,1,...,1,0,0,0,0,0,0,0,1,0

In [20]:
cf = pd.concat([df, dummies], axis = 1)
df.head()

,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_id,environment_satisfaction,gender,...,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,hours_trained_last_year,work_life_balance,company_years,current_role_years,years_since_last_promotion,years_with_manager
Age,,,,,,,,,,,,,,,,,,,,,
41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,2,Female,...,3,1,0,8,0,1,6,4,0,5
49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,2,3,Male,...,4,4,1,10,3,3,10,7,1,7
37,1,Travel_Rarely,1373,Research & Development,2,2,Other,4,4,Male,...,3,2,0,7,3,3,0,0,0,0
33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,5,4,Female,...,3,3,0,8,3,3,8,7,3,0
27,0,Travel_Rarely,591,Research & Development,2,1,Medical,7,1,Male,...,3,4,1,6,3,3,2,2,2,2

In [22]:
cf.head()

,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_id,environment_satisfaction,gender,...,lab_tech_job,manager_job,manufacturing_dir_job,research_dir_job,research_scientist_job,sales_exec_job,sales_rep_job,divorced,married,single
Age,,,,,,,,,,,,,,,,,,,,,
41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,2,Female,...,0,0,0,0,0,1,0,0,0,1
49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,2,3,Male,...,0,0,0,0,1,0,0,0,1,0
37,1,Travel_Rarely,1373,Research & Development,2,2,Other,4,4,Male,...,1,0,0,0,0,0,0,0,0,1
33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,5,4,Female,...,0,0,0,0,1,0,0,0,1,0
27,0,Travel_Rarely,591,Research & Development,2,1,Medical,7,1,Male,...,1,0,0,0,0,0,0,0,1,0

In [21]:
d

NameError: name 'd' is not defined

In [ ]:
#split the data
train, validate, test = wrangle.class_split_data(df, 'attrition')

In [ ]:
#juxtapose subset shapes
train.shape, validate.shape, test.shape

In [ ]:
#loop through numeric features to view distributions
explore.plot_distributions(df, numeric)